xmlsource/rdfsparqlsoap.xml

<?xml version="1.0" encoding="UTF-8"?>
<section xmlns:xlink="http://www.w3.org/1999/xlink" xmlns="http://docbook.org/ns/docbook" xml:id="rdfsparqlsoap">
        <title>Sending SOAP Requests to Virtuoso SPARQL Endpoint</title>
        <para>This section presents a sample scenario on how to execute a SPARQL query as a SOAP
  	request to the Virtuoso SPARQL Endpoint.
  </para>
        <orderedlist>
          <listitem>
            <para>Assume the following sample SOAP request containing simple SPARQL query:
</para>
            <programlisting>
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
   &lt;soapenv:Body&gt;
      &lt;query-request xmlns="http://www.w3.org/2005/09/sparql-protocol-types/#"&gt;
         &lt;query xmlns=""&gt;SELECT DISTINCT ?z FROM virtrdf: {?x ?y ?z .} LIMIT 10&lt;/query&gt;
      &lt;/query-request&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</programlisting>
          </listitem>
          <listitem>
            <para>Save locally the content from above for ex. to file with the name "soap.xml".</para>
          </listitem>
          <listitem>
            <para>To pass the SOAP request to a Virtuoso SPARQL Endpoint, execute the following curl command:
</para>
            <programlisting>
$ curl -d@soap.xml -H "Content-Type:text/xml" -H "SOAPAction: ''" http://example.com/sparql
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soapenv:Body&gt;
    &lt;query-result xmlns="http://www.w3.org/2005/09/sparql-protocol-types/#"&gt;
      &lt;sparql xmlns="http://www.w3.org/2005/sparql-results#" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2001/sw/DataAccess/rf1/result2.xsd"&gt;
        &lt;head&gt;
         &lt;variable name="z"/&gt;
        &lt;/head&gt;
        &lt;results distinct="false" ordered="true"&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadStorage&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapFormat&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMap&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapValue&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapColumn&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapColumn&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapATable&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapATable&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name="z"&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapFText&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
        &lt;/results&gt;
      &lt;/sparql&gt;
    &lt;/query-result&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</programlisting>
          </listitem>
        </orderedlist>
      </section>
